app/controllers/comments_controller.rb

SELECT "trees".* FROM "trees" WHERE "trees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def index
    @tree = Tree.find_by(id: params[:tree_id])

INSERT INTO "comments" ("comment", "tree_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "hello"], ["tree_id", 1], ["created_at", "2021-05-28 15:34:24.838799"], ["updated_at", "2021-05-28 15:34:24.838799"]]
---
  def create
    @comment = Comment.new(comment_params)

    if @comment.save