app/controllers/trees_controller.rb

SELECT "trees".* FROM "trees" WHERE "trees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_tree
      @tree = Tree.find(params[:id])