app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "test"], ["created_at", "2021-05-25 21:18:41.639511"], ["updated_at", "2021-05-25 21:18:41.639511"]]
---
  def create
    @user = User.new(user_params)

    if @user.save